app/views/events/_form.html.erb

SELECT "members".* FROM "members" INNER JOIN "events_members" ON "members"."id" = "events_members"."member_id" WHERE "events_members"."event_id" = 3
---
<%= f.label :members %>
<%= select_tag "member_team", options_from_collection_for_select(Member.all, 'id', 'first_name',@event.members.map{ |j| j.id }), :multiple => true %>