app/views/events/show.html.erb

  				</tr>
					<% @event.members.each do |member| %>
---
SELECT "members".* FROM "members" INNER JOIN "events_members" ON "members"."id" = "events_members"."member_id" WHERE "events_members"."event_id" = 2