app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT "events".* FROM "events"

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @event = Event.new(event_params)
    #@event.tracked = false
    if event_params[:invite] == "all"
    @members = Member.all
    @event.members << @members
    elsif event_params[:invite] == "officers"
    @members = Member.where(designation: 'officer')
---
SELECT "members".* FROM "members"
INSERT INTO "events" ("created_at", "date", "description", "invite", "location", "time", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "members".* FROM "members" WHERE "members"."designation" = 'officer'

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]

  def update
			@event = Event.find(params[:id])
			if event_params[:invite] == "all"
			 @event.members.destroy_all
			 @members = Member.all
			 @event.members << @members				#if all members are invited, insert all members in the join table
			elsif event_params[:invite] == "officers"
			 @event.members.destroy_all
			 @members = Member.where(designation: 'officer')
			 @event.members << @members				#if only officers are invited, insert members with officer designation only in the join table
			end

    if @event.update_attributes(event_params)
      if @event.members.any?
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "members".* FROM "members"
SELECT "members".* FROM "members" WHERE "members"."designation" = 'officer'
UPDATE "events" SET "time" = '2000-01-01 15:00:00.000000', "updated_at" = '2015-03-31 17:04:42.616055' WHERE "events"."id" = 1
SELECT "members".* FROM "members" INNER JOIN "events_members" ON "members"."id" = "events_members"."member_id" WHERE "events_members"."event_id" = 3

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]

  def track
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "10"]]

  def attend
    @event = Event.find(params[:event_id].to_s)
    @event.members.destroy_all			#after loading all invitees, destroy all entries so we can save only the attendees
    @member = Member.find(params[:event_member_id.to_s])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", :event_id]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "[\"1\", \"3\"]"]]