app/controllers/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @member = Member.find(params[:id])

INSERT INTO "members" ("created_at", "department", "designation", "email", "first_name", "last_name", "paying", "status", "uin", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @member = Member.new(member_params)
    if @member.save

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @member = Member.find(params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "members" SET "designation" = 'Officer', "updated_at" = '2015-03-30 18:18:58.320128' WHERE "members"."id" = 17
---
  def update
    @member = Member.find(params[:id])
    if @member.update_attributes(member_params)

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 1]]
---
  def destroy
    @member = Member.find(params[:id])
    @member.destroy