app/views/members/show.html.erb

<strong>Events:</strong>
<% @member.events.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "events_members" ON "events"."id" = "events_members"."event_id" WHERE "events_members"."member_id" = 4